Курс_Бухгалтерские_задачи/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Курс_Бухгалтерские_задачи/src/CommonModules/БухгалтерияСервер/Module.bsl
Процедура УстановкаНастроек() ЭКспорт
	
	НКП = Новый НастройкиКлиентскогоПриложения;
	
	НКП.ВариантМасштабаФормКлиентскогоПриложения = ВариантМасштабаФормКлиентскогоПриложения.Компактный;
	
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиКлиентскогоПриложения",,НКП);
	
КонецПроцедуры
 
Процедура УстановитьПодразделениеПроводки(Проводка, Подразделение, ДтКт)
	Если Проводка["Счет" + ДтКт].УчетПоПодразделениям Тогда
		Проводка["Подразделение" + ДтКт] = Подразделение;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьПодразделенияПроводки(Проводка, ПодразделениеДт, ПодразделениеКт) Экспорт
	УстановитьПодразделениеПроводки(Проводка, ПодразделениеДт, "Дт");
	УстановитьПодразделениеПроводки(Проводка, ПодразделениеКт, "Кт");
КонецПроцедуры

Процедура УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Счет) 
		ИЛИ НЕ ЗначениеЗаполнено(ИмяСубконто) Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСчета = БухгалтерияСерверПовторно.ПолучитьСвойстваСчета(Счет);
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда 
		Если ИмяСубконто > ДанныеСчета.КоличествоСубконто Тогда
			Возврат;
		КонецЕсли;
		ВидСубконтоСсылка = ДанныеСчета["ВидСубконто"+ИмяСубконто];
	Иначе 
		ВидСубконтоСсылка = ПланыВидовХарактеристик.ВидыСубконто[ИмяСубконто];
		Если ДанныеСчета.ВидСубконто1 <> ВидСубконтоСсылка
			И ДанныеСчета.ВидСубконто2 <> ВидСубконтоСсылка Тогда	
			Возврат;
		КонецЕсли;
	КонецЕсли;
	    
	Если ВидСубконтоСсылка.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		Субконто.Вставить(ВидСубконтоСсылка, ЗначениеСубконто);
	КонецЕсли;
	
КонецПроцедуры

Функция РассчитатьЭквивалент(ВалютнаяСумма, Валюта, Дата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА Курсы.Курс = 0
	|			ТОГДА 1
	|		ИНАЧЕ Курсы.Курс
	|	КОНЕЦ КАК Курс,
	|	ВЫБОР
	|		КОГДА Курсы.Кратность = 0
	|			ТОГДА 1
	|		ИНАЧЕ Курсы.Кратность
	|	КОНЕЦ КАК Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, 
	|	Валюта = &Валюта) КАК Курсы";
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат ВалютнаяСумма * Выборка.Курс / Выборка.Кратность;
	КонецЕсли;
	Возврат ВалютнаяСумма;	
КонецФункции

Функция ПолучитьКурсКратностьВалюты(Дата, Валюта) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта,
		|	КурсыВалютСрезПоследних.Курс,
		|	КурсыВалютСрезПоследних.Кратность
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &Валюта) КАК КурсыВалютСрезПоследних";
	
	Запрос.УстановитьПараметр("Период", Дата);
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.Курс / ВыборкаДетальныеЗаписи.Кратность;
	КонецЦикла;
	Возврат 0;
КонецФункции

Функция ПолучитьКроссКурсВалют(Валюта1, Валюта2, Период) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Курсы.Валюта,
	|	Курсы.Курс,
	|	Курсы.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют.СрезПоследних(&Период, 
	|		Валюта В (&Валюта1, &Валюта2)) КАК Курсы";
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Валюта1", Валюта1);
	Запрос.УстановитьПараметр("Валюта2", Валюта2);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.НайтиСледующий(Валюта1, "Валюта") Тогда
		КурсВалюты1 = ?(Выборка.Курс = 0, 1, Выборка.Курс);
		КратностьВалюты1 = ?(Выборка.Кратность = 0, 1, Выборка.Кратность);
	КонецЕсли;
	Если Выборка.НайтиСледующий(Валюта2, "Валюта") Тогда
		КурсВалюты2 = ?(Выборка.Курс = 0, 1, Выборка.Курс);
		КратностьВалюты2 = ?(Выборка.Кратность = 0, 1, Выборка.Кратность);
	КонецЕсли;
	КроссКурс = (КурсВалюты1/КратностьВалюты1)/(КурсВалюты2*КратностьВалюты2);
	Возврат КроссКурс;
КонецФункции
